Revit 2017 API
ICodeCheckingParameterServer.PerformCodeChecking Method
 The server's method that will be called when Revit User clicks the Code Checking parameter's button from the properties palette.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
bool PerformCodeChecking(
	CodeCheckingParameterServiceData data
)
Visual Basic
Function PerformCodeChecking ( _
	data As CodeCheckingParameterServiceData _
) As Boolean
Visual C++
bool PerformCodeChecking(
	CodeCheckingParameterServiceData^ data
)
Parameters
data
Type: Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData
 The Code Checking data.
Return Value
 Indicates whether the code checking parameter server is executed successfully.
Remarks
 The server provides UI way for Revit user to view and modify the detail data corresponding with the parameter value. The server may also modify the code checking parameter value itself during the execution. The method should always return 'true' if the server is successfully executed, no matter whether the server changes anything. Return 'false' or if the server throws, indicates a failed case, all changes made by the server will be discarded.
See Also
ICodeCheckingParameterServer Interface
Autodesk.Revit.DB.Structure Namespace